# Business Requirements - ETL

### 1. Functional Requirements - Load Credit Card Database (SQL)

Req-1.1 Data Extraction and Transformation with Python and PySpark

For “Credit Card System,” create a Python and PySpark SQL program to read/extract the following JSON files    
        according to the specifications found in the mapping document.

        1. CDW_SAPP_BRANCH.JSON
        2. CDW_SAPP_CREDITCARD.JSON
        3. CDW_SAPP_CUSTOMER.JSON

In [403]:
import findspark
findspark.init()
import pyspark
from pyspark.sql import SparkSession
from pyspark.sql.functions import *
from dotenv import load_dotenv
import os
import pandas as pd

In [44]:
#create spark session
spark = SparkSession.builder.master("local[*]").appName("Capstone").getOrCreate()

In [45]:
#load/read cdw_sapp_custmer.json file into spark dataframe 
customer_df=spark.read.load("creditcard_system_data/cdw_sapp_custmer.json",format="json")

In [46]:
#show first five records from the customer dataframe
customer_df.show(5,truncate=False)

+------+----------------+------------+-------------+-------------------+----------+----------+--------+----------+---------+-----------------------------+-----------+---------+-----------------+
|APT_NO|CREDIT_CARD_NO  |CUST_CITY   |CUST_COUNTRY |CUST_EMAIL         |CUST_PHONE|CUST_STATE|CUST_ZIP|FIRST_NAME|LAST_NAME|LAST_UPDATED                 |MIDDLE_NAME|SSN      |STREET_NAME      |
+------+----------------+------------+-------------+-------------------+----------+----------+--------+----------+---------+-----------------------------+-----------+---------+-----------------+
|656   |4210653310061055|Natchez     |United States|AHooper@example.com|1237818   |MS        |39120   |Alec      |Hooper   |2018-04-21T12:49:02.000-04:00|Wm         |123456100|Main Street North|
|829   |4210653310102868|Wethersfield|United States|EHolman@example.com|1238933   |CT        |06109   |Etta      |Holman   |2018-04-21T12:49:02.000-04:00|Brendan    |123453023|Redwood Drive    |
|683   |4210653310116272|Huntley     |United States|WDunham@example.com|1243018   |IL        |60142   |Wilber    |Dunham   |2018-04-21T12:49:02.000-04:00|Ezequiel   |123454487|12th Street East |
|253   |4210653310195948|NewBerlin   |United States|EHardy@example.com |1243215   |WI        |53151   |Eugenio   |Hardy    |2018-04-21T12:49:02.000-04:00|Trina      |123459758|Country Club Road|
|301   |4210653310356919|ElPaso      |United States|WAyers@example.com |1242074   |TX        |79930   |Wilfred   |Ayers    |2018-04-21T12:49:02.000-04:00|May        |123454431|Madison Street   |
+------+----------------+------------+-------------+-------------------+----------+----------+--------+----------+---------+-----------------------------+-----------+---------+-----------------+
only showing top 5 rows

In [47]:
#print schema of the dataset
customer_df.printSchema()

root
 |-- APT_NO: string (nullable = true)
 |-- CREDIT_CARD_NO: string (nullable = true)
 |-- CUST_CITY: string (nullable = true)
 |-- CUST_COUNTRY: string (nullable = true)
 |-- CUST_EMAIL: string (nullable = true)
 |-- CUST_PHONE: long (nullable = true)
 |-- CUST_STATE: string (nullable = true)
 |-- CUST_ZIP: string (nullable = true)
 |-- FIRST_NAME: string (nullable = true)
 |-- LAST_NAME: string (nullable = true)
 |-- LAST_UPDATED: string (nullable = true)
 |-- MIDDLE_NAME: string (nullable = true)
 |-- SSN: long (nullable = true)
 |-- STREET_NAME: string (nullable = true)

In [48]:
#temporary table view of the custmer dataframe
customer_df.createOrReplaceTempView("customer")

In [51]:
#trnasform data as per mapping document
transform_customer_df=spark.sql("SELECT CAST(SSN AS INT) AS SSN,\
                            CONCAT(UPPER(SUBSTR(FIRST_NAME,1,1)),LOWER(substr(FIRST_NAME,2))) AS FIRST_NAME, \
                            CONCAT(LOWER(MIDDLE_NAME)) MIDDLE_NAME, \
                            CONCAT(UPPER(substr(LAST_NAME,1,1)),LOWER(substr(LAST_NAME,2))) AS LAST_NAME, \
                            CREDIT_CARD_NO,\
                            CONCAT(STREET_NAME, ',' ,APT_NO) AS FULL_STREET_ADDRESS, \
                            CUST_CITY, \
                            CUST_STATE, \
                            CUST_COUNTRY,\
                            CAST(CUST_ZIP AS INT) AS CUST_ZIP, \
                            CONCAT('(',LEFT(RAND()*100+201,3),')',SUBSTR(CUST_PHONE,1,3),'-',SUBSTR(CUST_PHONE,4)) AS CUST_PHONE, \
                            CUST_EMAIL,\
                            CAST(LAST_UPDATED AS TIMESTAMP) AS LAST_UPDATED\
                            FROM customer")

In [52]:
#show first 5 records from the transform customer dataframe
transform_customer_df.show(5,truncate=False)

+---------+----------+-----------+---------+----------------+---------------------+------------+----------+-------------+--------+-------------+-------------------+-------------------+
|SSN      |FIRST_NAME|MIDDLE_NAME|LAST_NAME|CREDIT_CARD_NO  |FULL_STREET_ADDRESS  |CUST_CITY   |CUST_STATE|CUST_COUNTRY |CUST_ZIP|CUST_PHONE   |CUST_EMAIL         |LAST_UPDATED       |
+---------+----------+-----------+---------+----------------+---------------------+------------+----------+-------------+--------+-------------+-------------------+-------------------+
|123456100|Alec      |wm         |Hooper   |4210653310061055|Main Street North,656|Natchez     |MS        |United States|39120   |(208)123-7818|AHooper@example.com|2018-04-21 12:49:02|
|123453023|Etta      |brendan    |Holman   |4210653310102868|Redwood Drive,829    |Wethersfield|CT        |United States|6109    |(243)123-8933|EHolman@example.com|2018-04-21 12:49:02|
|123454487|Wilber    |ezequiel   |Dunham   |4210653310116272|12th Street East,683 |Huntley     |IL        |United States|60142   |(211)124-3018|WDunham@example.com|2018-04-21 12:49:02|
|123459758|Eugenio   |trina      |Hardy    |4210653310195948|Country Club Road,253|NewBerlin   |WI        |United States|53151   |(201)124-3215|EHardy@example.com |2018-04-21 12:49:02|
|123454431|Wilfred   |may        |Ayers    |4210653310356919|Madison Street,301   |ElPaso      |TX        |United States|79930   |(245)124-2074|WAyers@example.com |2018-04-21 12:49:02|
+---------+----------+-----------+---------+----------------+---------------------+------------+----------+-------------+--------+-------------+-------------------+-------------------+
only showing top 5 rows

In [53]:
#printschema of transform cutomer dataframe
transform_customer_df.printSchema()

root
 |-- SSN: integer (nullable = true)
 |-- FIRST_NAME: string (nullable = true)
 |-- MIDDLE_NAME: string (nullable = true)
 |-- LAST_NAME: string (nullable = true)
 |-- CREDIT_CARD_NO: string (nullable = true)
 |-- FULL_STREET_ADDRESS: string (nullable = true)
 |-- CUST_CITY: string (nullable = true)
 |-- CUST_STATE: string (nullable = true)
 |-- CUST_COUNTRY: string (nullable = true)
 |-- CUST_ZIP: integer (nullable = true)
 |-- CUST_PHONE: string (nullable = true)
 |-- CUST_EMAIL: string (nullable = true)
 |-- LAST_UPDATED: timestamp (nullable = true)

In [54]:
#read/load cdw_sapp_branch.json file into spark branch dataframe
branch_df=spark.read.load("creditcard_system_data/cdw_sapp_branch.json",format="json")

In [55]:
#show first five record from branch dataframe
branch_df.show(4,truncate=False)

+-----------------+-----------+------------+------------+------------+-----------------+----------+-----------------------------+
|BRANCH_CITY      |BRANCH_CODE|BRANCH_NAME |BRANCH_PHONE|BRANCH_STATE|BRANCH_STREET    |BRANCH_ZIP|LAST_UPDATED                 |
+-----------------+-----------+------------+------------+------------+-----------------+----------+-----------------------------+
|Lakeville        |1          |Example Bank|1234565276  |MN          |Bridle Court     |55044     |2018-04-18T16:51:47.000-04:00|
|Huntley          |2          |Example Bank|1234618993  |IL          |Washington Street|60142     |2018-04-18T16:51:47.000-04:00|
|SouthRichmondHill|3          |Example Bank|1234985926  |NY          |Warren Street    |11419     |2018-04-18T16:51:47.000-04:00|
|Middleburg       |4          |Example Bank|1234663064  |FL          |Cleveland Street |32068     |2018-04-18T16:51:47.000-04:00|
+-----------------+-----------+------------+------------+------------+-----------------+----------+-----------------------------+
only showing top 4 rows

In [56]:
#print schema of brach dataframe
branch_df.printSchema()

root
 |-- BRANCH_CITY: string (nullable = true)
 |-- BRANCH_CODE: long (nullable = true)
 |-- BRANCH_NAME: string (nullable = true)
 |-- BRANCH_PHONE: string (nullable = true)
 |-- BRANCH_STATE: string (nullable = true)
 |-- BRANCH_STREET: string (nullable = true)
 |-- BRANCH_ZIP: long (nullable = true)
 |-- LAST_UPDATED: string (nullable = true)

In [73]:
#transformed branch dataframe according to the mapping document
transform_branch_df=branch_df.select(col("BRANCH_CODE").astype('int').alias('BRANCH_CODE'),\
                 col("BRANCH_NAME"),\
                 col("BRANCH_STREET"), \
                 col("BRANCH_CITY"),\
                 col("BRANCH_STATE"), \
                 when(col("BRANCH_ZIP").isNull(),'99999').otherwise(col("BRANCH_ZIP")).astype('int').alias('BRANCH_ZIP'),\
                 (concat( lit("(") ,substring(col("BRANCH_PHONE"),1,3),lit(")") ,substring(col("BRANCH_PHONE"),4,3), \
                          lit("-") ,substring(col("BRANCH_PHONE"),7,4) )).alias("BRANCH_PHONE"),\
                 to_timestamp(col("LAST_UPDATED")).alias("LAST_UPDATED")
                )

In [74]:
#print schema of transformed branch dataframe
transform_branch_df.printSchema()

root
 |-- BRANCH_CODE: integer (nullable = true)
 |-- BRANCH_NAME: string (nullable = true)
 |-- BRANCH_STREET: string (nullable = true)
 |-- BRANCH_CITY: string (nullable = true)
 |-- BRANCH_STATE: string (nullable = true)
 |-- BRANCH_ZIP: integer (nullable = true)
 |-- BRANCH_PHONE: string (nullable = true)
 |-- LAST_UPDATED: timestamp (nullable = true)

In [75]:
#show first five records from transformed dataframe
transform_branch_df.show(5,truncate=True)

+-----------+------------+-----------------+-----------------+------------+----------+-------------+-------------------+
|BRANCH_CODE| BRANCH_NAME|    BRANCH_STREET|      BRANCH_CITY|BRANCH_STATE|BRANCH_ZIP| BRANCH_PHONE|       LAST_UPDATED|
+-----------+------------+-----------------+-----------------+------------+----------+-------------+-------------------+
|          1|Example Bank|     Bridle Court|        Lakeville|          MN|     55044|(123)456-5276|2018-04-18 16:51:47|
|          2|Example Bank|Washington Street|          Huntley|          IL|     60142|(123)461-8993|2018-04-18 16:51:47|
|          3|Example Bank|    Warren Street|SouthRichmondHill|          NY|     11419|(123)498-5926|2018-04-18 16:51:47|
|          4|Example Bank| Cleveland Street|       Middleburg|          FL|     32068|(123)466-3064|2018-04-18 16:51:47|
|          5|Example Bank|      14th Street|    KingOfPrussia|          PA|     19406|(123)484-9701|2018-04-18 16:51:47|
+-----------+------------+-----------------+-----------------+------------+----------+-------------+-------------------+
only showing top 5 rows

In [76]:
#read/load cdw_sapp_credit.json file into pandas credit dataframe
credit_df=spark.read.load("creditcard_system_data/cdw_sapp_credit.json",format="json").toPandas()

In [77]:
#first five records from credit dataframe
credit_df.head(5)

,BRANCH_CODE,CREDIT_CARD_NO,CUST_SSN,DAY,MONTH,TRANSACTION_ID,TRANSACTION_TYPE,TRANSACTION_VALUE,YEAR
0,114,4210653349028689,123459988,14,2,1,Education,78.90,2018
1,35,4210653349028689,123459988,20,3,2,Entertainment,14.24,2018
2,160,4210653349028689,123459988,8,7,3,Grocery,56.70,2018
3,114,4210653349028689,123459988,19,4,4,Entertainment,59.73,2018
4,93,4210653349028689,123459988,10,10,5,Gas,3.59,2018

In [78]:
#datatypes of credit dataset
credit_df.dtypes

BRANCH_CODE            int64
CREDIT_CARD_NO        object
CUST_SSN               int64
DAY                    int64
MONTH                  int64
TRANSACTION_ID         int64
TRANSACTION_TYPE      object
TRANSACTION_VALUE    float64
YEAR                   int64
dtype: object

In [79]:
#transform credit dataframe according to mapping document
credit_df['MONTH']=credit_df['MONTH'].astype(str).str.zfill(2)
credit_df['DAY']=credit_df['DAY'].astype(str).str.zfill(2)
credit_df["TIMEID"]=credit_df['YEAR'].astype(str)+ \
                    credit_df['MONTH'] + credit_df['DAY']
credit_df.rename(columns={'CREDIT_CARD_NO':'CUST_CC_NO'},inplace=True)

In [80]:
#first 10 records from the transformed dataframe
credit_df.head(10)

,BRANCH_CODE,CUST_CC_NO,CUST_SSN,DAY,MONTH,TRANSACTION_ID,TRANSACTION_TYPE,TRANSACTION_VALUE,YEAR,TIMEID
0,114,4210653349028689,123459988,14,02,1,Education,78.90,2018,20180214
1,35,4210653349028689,123459988,20,03,2,Entertainment,14.24,2018,20180320
2,160,4210653349028689,123459988,08,07,3,Grocery,56.70,2018,20180708
3,114,4210653349028689,123459988,19,04,4,Entertainment,59.73,2018,20180419
4,93,4210653349028689,123459988,10,10,5,Gas,3.59,2018,20181010
5,164,4210653349028689,123459988,28,05,6,Education,6.89,2018,20180528
6,119,4210653349028689,123459988,19,05,7,Entertainment,43.39,2018,20180519
7,23,4210653349028689,123459988,08,08,8,Gas,95.39,2018,20180808
8,166,4210653349028689,123459988,18,03,9,Entertainment,93.26,2018,20180318
9,83,4210653349028689,123459988,03,09,10,Bills,100.38,2018,20180903

In [81]:
#selected columns to be added into transformed dataframe
trans_credit_df=credit_df[['CUST_CC_NO','TIMEID','CUST_SSN','BRANCH_CODE','TRANSACTION_TYPE','TRANSACTION_VALUE','TRANSACTION_ID']]

In [82]:
#first 10 records from transformed customer dataframe
trans_credit_df.head(10)

,CUST_CC_NO,TIMEID,CUST_SSN,BRANCH_CODE,TRANSACTION_TYPE,TRANSACTION_VALUE,TRANSACTION_ID
0,4210653349028689,20180214,123459988,114,Education,78.90,1
1,4210653349028689,20180320,123459988,35,Entertainment,14.24,2
2,4210653349028689,20180708,123459988,160,Grocery,56.70,3
3,4210653349028689,20180419,123459988,114,Entertainment,59.73,4
4,4210653349028689,20181010,123459988,93,Gas,3.59,5
5,4210653349028689,20180528,123459988,164,Education,6.89,6
6,4210653349028689,20180519,123459988,119,Entertainment,43.39,7
7,4210653349028689,20180808,123459988,23,Gas,95.39,8
8,4210653349028689,20180318,123459988,166,Entertainment,93.26,9
9,4210653349028689,20180903,123459988,83,Bills,100.38,10

In [84]:
#creting spark dataframe from transformed pandas customer dataframe
transform_credit_df=spark.createDataFrame(trans_credit_df)

In [85]:
#show first five records from customer spark dataframe
transform_credit_df.show(5,truncate=True)

+----------------+--------+---------+-----------+----------------+-----------------+--------------+
|      CUST_CC_NO|  TIMEID| CUST_SSN|BRANCH_CODE|TRANSACTION_TYPE|TRANSACTION_VALUE|TRANSACTION_ID|
+----------------+--------+---------+-----------+----------------+-----------------+--------------+
|4210653349028689|20180214|123459988|        114|       Education|             78.9|             1|
|4210653349028689|20180320|123459988|         35|   Entertainment|            14.24|             2|
|4210653349028689|20180708|123459988|        160|         Grocery|             56.7|             3|
|4210653349028689|20180419|123459988|        114|   Entertainment|            59.73|             4|
|4210653349028689|20181010|123459988|         93|             Gas|             3.59|             5|
+----------------+--------+---------+-----------+----------------+-----------------+--------------+
only showing top 5 rows

In [98]:
load_dotenv()
USER=os.environ.get('user')
PASSWORD=os.environ.get('password')

### Req-1.2   
Data loading into Database

Create a Python and Pyspark Program to load/write the “Credit Card System Data” into RDBMS(creditcard_capstone).     
Tables should be created by the following names in RDBMS:     

      CDW_SAPP_BRANCH    
      CDW_SAPP_CREDIT_CARD    
      CDW_SAPP_CUSTOMER

In [87]:
#load branch data from spark dataframe into reditcard_capstone.CDW_SAPP_BRANCH table in RDBMS
transform_branch_df.write \
                    .format("jdbc") \
                    .mode("overwrite") \
                    .option("truncate","true") \
                    .option("url", "jdbc:mysql://localhost:3308/") \
                    .option("createTableColumnTypes", "BRANCH_CODE INT,BRANCH_NAME VARCHAR(25),BRANCH_STREET VARCHAR(50),\
                                                       BRANCH_CITY VARCHAR(25), BRANCH_STATE VARCHAR(10),BRANCH_ZIP INT,\
                                                       BRANCH_PHONE VARCHAR(25),LAST_UPDATED TIMESTAMP")\
                    .option("dbtable", "creditcard_capstone.CDW_SAPP_BRANCH") \
                    .option("truncate","true") \
                    .option("user", USER) \
                    .option("password", PASSWORD) \
                    .option("characterEncoding","UTF-8") \
                    .option("useUnicode", "true") \
                    .save()

In [89]:
#load creditcard data from spark dataframe into reditcard_capstone.CDW_SAPP_CREDIT_CARD table in RDBMS
transform_credit_df.write \
                    .format("jdbc") \
                    .mode("overwrite") \
                    .option("truncate","true") \
                    .option("url", "jdbc:mysql://localhost:3308/") \
                    .option("createTableColumnTypes", "CUST_CC_NO VARCHAR(25),TIMEID VARCHAR(15),CUST_SSN INT,\
                                                       BRANCH_CODE INT, TRANSACTION_TYPE VARCHAR(25),TRANSACTION_VALUE DOUBLE,\
                                                       TRANSACTION_ID INT")\
                    .option("dbtable", "creditcard_capstone.CDW_SAPP_CREDIT_CARD") \
                    .option("truncate","true") \
                    .option("user", USER) \
                    .option("password", PASSWORD) \
                    .option("characterEncoding","UTF-8") \
                    .option("useUnicode", "true") \
                    .save()

In [92]:
#load cUSTOMER data from spark dataframe into reditcard_capstone.CDW_SAPP_CREDIT_CARD table in RDBMS
transform_customer_df.write \
                    .format("jdbc") \
                    .mode("overwrite") \
                    .option("truncate","true") \
                    .option("url", "jdbc:mysql://localhost:3308/") \
                    .option("createTableColumnTypes", "SSN INT,FIRST_NAME VARCHAR(25),MIDDLE_NAME VARCHAR(25),LAST_NAME VARCHAR(25),\
                                                       CREDIT_CARD_NO VARCHAR(25),FULL_STREET_ADDRESS VARCHAR(50),CUST_CITY VARCHAR(25),\
                                                       CUST_STATE VARCHAR(25),CUST_COUNTRY VARCHAR(25),CUST_ZIP INT,CUST_PHONE VARCHAR(15),\
                                                       CUST_EMAIL VARCHAR(50),LAST_UPDATED TIMESTAMP")\
                    .option("dbtable", "creditcard_capstone.CDW_SAPP_CUSTOMER") \
                    .option("truncate","true") \
                    .option("user", USER) \
                    .option("password", PASSWORD) \
                    .option("characterEncoding","UTF-8") \
                    .option("useUnicode", "true") \
                    .save()

### 2. Functional Requirements - Application Front-End

Once data is loaded into the database, we need a front-end (console) to see/display data.    
For that, create a console-based Python program to satisfy System Requirements 2 (2.1 and 2.2).   

 2.1 Transaction Details Module \    
* 1. Used to display the transactions made by customers living in a given zip code for a given month and year. 
              Order by day in descending order.
* 2.  Used to display the number and total values of transactions for a given type.          
* 3.  Used to display the number and total values of transactions for branches in a given state.    

2.2 Customer Details Module     
* 1. Used to check the existing account details of a customer.   
* 2. Used to modify the existing account details of a customer.  
* 3. Used to generate a monthly bill for a credit card number for a given month and year.    
* 4. Used to display the transactions made by a customer between two dates. Order by year, month, and day in descending order.

In [115]:
#load branch data from creditcard_capstone.CDW_SAPP_BRANCH to spark dataframe
load_branch=spark.read\
                    .format("jdbc")\
                    .options(driver="com.mysql.cj.jdbc.Driver",\
                          user=USER,\
                          password=PASSWORD,\
                          url="jdbc:mysql://localhost:3308/",\
                          dbtable="creditcard_capstone.CDW_SAPP_BRANCH")\
                    .load()

#load creditcard data from creditcard_capstone.CDW_SAPP_CREDIT_CARD to spark dataframe
load_credit=spark.read\
                    .format("jdbc")\
                    .options(driver="com.mysql.cj.jdbc.Driver",\
                          user=USER,\
                          password=PASSWORD,\
                          url="jdbc:mysql://localhost:3308/",\
                          dbtable="creditcard_capstone.CDW_SAPP_CREDIT_CARD")\
                    .load()

#load customer data from creditcard_capstone.CDW_SAPP_CUSTOMER to spark dataframe
load_customer=spark.read\
                    .format("jdbc")\
                    .options(driver="com.mysql.cj.jdbc.Driver",\
                          user=USER,\
                          password=PASSWORD,\
                          url="jdbc:mysql://localhost:3308/",\
                          dbtable="creditcard_capstone.CDW_SAPP_CUSTOMER")\
                    .load()

#create temp vew of spark dataframe
load_branch.createOrReplaceTempView('branch')
load_credit.createOrReplaceTempView("credit_card")
load_customer.createOrReplaceTempView("customer")

In [385]:
#decorator to change funcionality of the print function
def Dprint(f):
    def inner(*arg,**kwarg):
        r=f(*arg,**kwarg)
        r.show()
        # return r
    return inner

* 1. Used to display the transactions made by customers living in a given zip code for a given month and year.     
              Order by day in descending order.

In [387]:
@Dprint
def transaction_by_zipcode(zipcode,year,month):
    return spark.sql("SELECT c.CUST_ZIP, \
                      c.FIRST_NAME, \
                      c.LAST_NAME,\
                      c.LAST_UPDATED,\
                      cc.*\
                      FROM credit_card cc\
                      JOIN customer c ON  c.SSN=cc.CUST_SSN\
                      WHERE c.CUST_ZIP = '{}' AND YEAR(to_date(TIMEID,'yyyyMMdd')) = '{}' \
                      AND MONTH(to_date(TIMEID,'yyyyMMdd'))='{}'\
                      ORDER BY day(to_date(TIMEID,'yyyyMMdd')) DESC".format(zipcode,year,month))

In [356]:
#function to get zipcode, year, month user input 
def tran1_input():
    while True:
        zipcode=input("\n Enter zipcode using 4-5 digits : ")
        zipcode=zipcode.strip()
        if (zipcode.isdigit()) and (len(zipcode) > 3 or len(zipcode) < 6):
            print("\n Valid zipcode")
            break
        else:
            print("\n Invalid zipcode entry...Try again")

    #year input       
    while True:
        year=input("\n Enter year using 4 digits :")
        year=year.strip()
        if year.isdigit() and len(year)==4:
            print("\n Valid Year")
            break
        else:
            print("\n Invalid year entry...Try again :")

    #month input
    while True:
        month=input("\n Enter month using 2 digits (example: March enter 03): ")
        month=month.strip().lstrip('0')
        if month.isdigit():
            if int(month) in range (0,13):
                print("\n Valid month :")
                break
            else:
                print("\n Invalid month entry...Try again :")
        else:
            print("\n Invalid month entry...Try again :")

    return zipcode,year,month

In [388]:
#calling function tran1_input() to get user input for zipcode, year and month.
#the return value of function is valid user input zipcode,year,month
zipcode,year,month=tran1_input()
print("\n Transactions made by customers living in zip code :{}, for a year :{}, and month :{} \n\
 output Order by day in descending order".format(zipcode,year,month))   
transaction_by_zipcode(zipcode,year,month)

# transaction_by_zipcode(60142,2018,9)

 Valid zipcode

 Valid Year

 Valid month :

 Transactions made by customers living in zip code :60142, for a year :2018, and month :9
 output Order by day in descending order
+--------+----------+---------+-------------------+----------------+--------+---------+-----------+----------------+-----------------+--------------+
|CUST_ZIP|FIRST_NAME|LAST_NAME|       LAST_UPDATED|      CUST_CC_NO|  TIMEID| CUST_SSN|BRANCH_CODE|TRANSACTION_TYPE|TRANSACTION_VALUE|TRANSACTION_ID|
+--------+----------+---------+-------------------+----------------+--------+---------+-----------+----------------+-----------------+--------------+
|   60142|    Rodger|   Chacon|2018-04-21 12:49:02|4210653316474645|20180928|123457245|         31|       Education|            37.61|         14278|
|   60142|    Rodger|   Chacon|2018-04-21 12:49:02|4210653316474645|20180927|123457245|          8|            Test|            12.84|         14293|
|   60142|  Cristina|  Spencer|2018-04-21 12:49:02|4210653348574254|20180927|123458563|         45|             Gas|            34.44|          6971|
|   60142|  Cristina|  Spencer|2018-04-21 12:49:02|4210653348574254|20180924|123458563|         47|         Grocery|              5.4|          6977|
|   60142|    Rodger|   Chacon|2018-04-21 12:49:02|4210653316474645|20180924|123457245|         12|           Bills|            62.55|         14346|
|   60142|    Rodger|   Chacon|2018-04-21 12:49:02|4210653316474645|20180920|123457245|         30|       Education|            45.81|         14273|
|   60142|    Wilber|   Dunham|2018-04-21 12:49:02|4210653310116272|20180918|123454487|         32|           Bills|            41.43|         28698|
|   60142|      Aron|   Guzman|2018-04-21 12:49:02|4210653331330633|20180917|123459511|         69|         Grocery|            50.99|          2464|
|   60142|    Wilber|   Dunham|2018-04-21 12:49:02|4210653310116272|20180915|123454487|         24|       Education|             3.11|         28724|
|   60142|      Aron|   Guzman|2018-04-21 12:49:02|4210653331330633|20180915|123459511|          2|   Entertainment|             80.7|          2404|
|   60142|     Allan|   Osborn|2018-04-21 12:49:02|4210653369092976|20180914|123454276|         18|             Gas|            63.06|         30120|
|   60142|    Rodger|   Chacon|2018-04-21 12:49:02|4210653316474645|20180914|123457245|        175|         Grocery|            37.53|         14312|
|   60142|     Allan|   Osborn|2018-04-21 12:49:02|4210653369092976|20180913|123454276|         10|      Healthcare|             35.6|         30159|
|   60142|    Wilber|   Dunham|2018-04-21 12:49:02|4210653310116272|20180912|123454487|         59|   Entertainment|           100.12|         28730|
|   60142|    Rodger|   Chacon|2018-04-21 12:49:02|4210653316474645|20180912|123457245|          4|       Education|            80.26|         14311|
|   60142|    Rodger|   Chacon|2018-04-21 12:49:02|4210653316474645|20180911|123457245|         18|         Grocery|            24.75|         14298|
|   60142|      Aron|   Guzman|2018-04-21 12:49:02|4210653331330633|20180910|123459511|         76|         Grocery|            24.03|          2428|
|   60142|      Aron|   Guzman|2018-04-21 12:49:02|4210653331330633|20180907|123459511|         43|   Entertainment|             62.1|          2414|
|   60142|      Aron|   Guzman|2018-04-21 12:49:02|4210653331330633|20180907|123459511|         49|           Bills|            39.58|          2400|
|   60142|    Rodger|   Chacon|2018-04-21 12:49:02|4210653316474645|20180904|123457245|         16|      Healthcare|            38.69|         14303|
+--------+----------+---------+-------------------+----------------+--------+---------+-----------+----------------+-----------------+--------------+
only showing top 20 rows

* 2)    Used to display the number and total values of transactions for a given type.

In [414]:
 #function to get the number and total values of transactions for a given type.
@Dprint
def tran_no_total_by(tr_type):
    return spark.sql("SELECT TRANSACTION_TYPE, COUNT(TRANSACTION_ID) AS NUM_OF_TRANSACTION, \
                        SUM(TRANSACTION_VALUE) AS TOTAL_TRAN_VALUES FROM credit_card\
                        WHERE TRANSACTION_TYPE='{}'\
                        GROUP BY TRANSACTION_TYPE".format(tr_type))

In [411]:
#funtion to get user input for transaction type
def tran2_input():
    print("Available Transaction Type")
    transaction_type=spark.sql("SELECT DISTINCT(TRANSACTION_TYPE) FROM credit_card")
    transaction_type.show()
    transaction_type= transaction_type.toPandas()
    transaction_type_list=pd.unique(transaction_type['TRANSACTION_TYPE'])
    while True:        
        tr_type=input("\nEnter Transaction Type : ")
        tr_type=tr_type.strip()
        if tr_type.title() in transaction_type_list:
            print("Valid Transaction Type ")
            break
        else:
            print("\nEntered Transaction type not found.. Try again..")
    return tr_type

In [415]:
tr_type=tran2_input()
tran_no_total_by(tr_type)

Available Transaction Type
+----------------+
|TRANSACTION_TYPE|
+----------------+
|       Education|
|   Entertainment|
|      Healthcare|
|         Grocery|
|            Test|
|             Gas|
|           Bills|
+----------------+

Valid Transaction Type
+----------------+------------------+------------------+
|TRANSACTION_TYPE|NUM_OF_TRANSACTION| TOTAL_TRAN_VALUES|
+----------------+------------------+------------------+
|             Gas|              6605|336059.25999999954|
+----------------+------------------+------------------+

* 3)    Used to display the number and total values of transactions for branches in a given state.

In [486]:
# function display the number and total values of transactions for branches in a given state.
@Dprint
def tran_no_total_byst(state):
    return spark.sql("SELECT cc.BRANCH_CODE AS BRANCH_CODE, \
                            COUNT(cc.TRANSACTION_ID) AS NO_TRANSACTION, \
                            SUM(TRANSACTION_VALUE) AS TOTAL_VALUE \
                            FROM customer C \
                            LEFT JOIN credit_card cc on C.SSN = cc.CUST_SSN \
                            WHERE C.CUST_STATE = '{}'\
                            GROUP BY cc.BRANCH_CODE\
                            ORDER BY cc.BRANCH_CODE".format(state))

In [517]:
#function to get user input for state.
def tran3_input():
    tr_state=spark.sql("SELECT DISTINCT(BRANCH_STATE) AS STATES FROM branch")
    tr_state= tr_state.toPandas()
    tr_state_list=pd.unique(tr_state['STATES'])
    print("Available Transaction States ::\n {}".format(tr_state_list))
    while True:
        state=input("\n Enter State using 2 letters as shown in above list")
        state=state.strip()
        if state.isalpha() and len(state) == 2:
            if state.upper() in tr_state_list:
                print("\nEntry is available for the entered state '{}' ::".format(state.upper()))
                break
            else:
                print("\nState is not found in list..Try again..")
        else:
            print("\nInvalid entry...Try again")
    return state

In [518]:
#calling using input. return type of this function is valid available state
state=tran3_input()
#calling function to get the number and total values of transactions for branches in a given state.
print("\n")
tran_no_total_byst(state)

Available Transaction States ::
 ['SC' 'MN' 'NJ' 'VA' 'KY' 'MI' 'WI' 'CA' 'CT' 'MT' 'NC' 'MD' 'IL' 'WA'
 'MS' 'AL' 'IN' 'OH' 'IA' 'PA' 'NY' 'TX' 'GA' 'MA' 'FL' 'AR']

Entry 'NY' is available for the entered state in transaction ::


+-----------+--------------+------------------+
|BRANCH_CODE|NO_TRANSACTION|       TOTAL_VALUE|
+-----------+--------------+------------------+
|          1|            30|1582.3599999999994|
|          2|            33|1536.2899999999997|
|          3|            54|2726.0399999999995|
|          4|            44|2031.4200000000003|
|          5|            34|1646.3100000000002|
|          7|            39|2092.0299999999997|
|          8|            43|           2193.71|
|          9|            45|2452.4100000000008|
|         10|            37|2112.6799999999994|
|         11|            46|2365.2100000000005|
|         12|            45|           2263.95|
|         14|            45|           2604.02|
|         15|            37|1918.7100000000003|
|         16|            43|2354.6500000000005|
|         17|            40|           2222.29|
|         18|            38|           2027.76|
|         19|            40|1906.6600000000003|
|         20|            33|1871.7399999999998|
|         21|            44|2529.4800000000005|
|         22|            36|1842.4799999999998|
+-----------+--------------+------------------+
only showing top 20 rows

In [463]:
tran_no_total_byst("MN")

+-----------+--------------+------------------+
|BRANCH_CODE|NO_TRANSACTION|       TOTAL_VALUE|
+-----------+--------------+------------------+
|          1|            10|            501.56|
|          2|             8|376.64000000000004|
|          3|            10|            528.31|
|          4|            13| 738.9000000000001|
|          5|            10|            579.36|
|          7|            11|            612.85|
|          8|            17|            930.15|
|          9|             9|            417.51|
|         10|            11|            496.75|
|         11|             8|            347.21|
|         12|             9|            597.29|
|         14|             5|            352.39|
|         15|            10|            365.34|
|         16|            13|            601.15|
|         17|            14| 644.2400000000001|
|         18|            13|            824.56|
|         19|             8|            487.82|
|         20|            12|            649.73|
|         21|             8| 280.7699999999999|
|         22|            18|            843.65|
+-----------+--------------+------------------+
only showing top 20 rows

In [446]:
def tran_stae(state):
    trr=spark.sql("SELECT \
                  COUNT(cc.TRANSACTION_ID) AS NO_OF_TRANS,\
                  SUM(cc.TRANSACTION_VALUE) AS TOTAL_VALUE \
                  FROM customer C \
                  LEFT JOIN credit_card CC c.SSN = cc.CUST_SSN \
                  WHERE c.CUST_STATE = '{}' \
                  GROUP BY cc.BRANCH_CODE\
                  ORDER BY cc.BRANCH_CODE".format(state))
    return trr

In [447]:
tmp=tran_stae("MN")

ParseException:
Syntax error at or near 'c'(line 1, pos 201)

== SQL ==
SELECT                   COUNT(cc.TRANSACTION_ID) AS NO_OF_TRANS,                  SUM(cc.TRANSACTION_VALUE) AS TOTAL_VALUE                   FROM customer C                   LEFT JOIN credit_card CC c.SSN = cc.CUST_SSN                   WHERE c.CUST_STATE = 'MN'                   GROUP BY cc.BRANCH_CODE                  ORDER BY cc.BRANCH_CODE
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------^^^

In [ ]:
tmp.show()

In [431]:
def tran_count_sum_bystate(br_state):
    tr_state=spark.sql("SELECT br.*,COUNT(TRANSACTION_ID) AS NUM_OF_TRANSACTION, \
                        SUM(TRANSACTION_VALUE) AS TRANSACTION_TOTAL\
                        FROM credit_card cc\
                        JOIN branch br ON cc.BRANCH_CODE=br.BRANCH_CODE \
                        WHERE br.BRANCH_STATE = '{}' \
                        GROUP BY br.BRANCH_NAME".format(br_state))
    return tr_state

In [432]:
trr=tran_count_sum_bystate("MN")

AnalysisException: expression 'br.BRANCH_CODE' is neither present in the group by, nor is it an aggregate function. Add to group by or wrap in first() (or first_value) if you don't care which value you get.;
Aggregate [BRANCH_NAME#1809], [BRANCH_CODE#1808, BRANCH_NAME#1809, BRANCH_STREET#1810, BRANCH_CITY#1811, BRANCH_STATE#1812, BRANCH_ZIP#1813, BRANCH_PHONE#1814, LAST_UPDATED#1815, count(TRANSACTION_ID#1830) AS NUM_OF_TRANSACTION#7257L, sum(TRANSACTION_VALUE#1829) AS TRANSACTION_TOTAL#7258]
+- Filter (BRANCH_STATE#1812 = MN)
   +- Join Inner, (BRANCH_CODE#1827 = BRANCH_CODE#1808)
      :- SubqueryAlias cc
      :  +- SubqueryAlias credit_card
      :     +- View (`credit_card`, [CUST_CC_NO#1824,TIMEID#1825,CUST_SSN#1826,BRANCH_CODE#1827,TRANSACTION_TYPE#1828,TRANSACTION_VALUE#1829,TRANSACTION_ID#1830])
      :        +- Relation [CUST_CC_NO#1824,TIMEID#1825,CUST_SSN#1826,BRANCH_CODE#1827,TRANSACTION_TYPE#1828,TRANSACTION_VALUE#1829,TRANSACTION_ID#1830] JDBCRelation(creditcard_capstone.CDW_SAPP_CREDIT_CARD) [numPartitions=1]
      +- SubqueryAlias br
         +- SubqueryAlias branch
            +- View (`branch`, [BRANCH_CODE#1808,BRANCH_NAME#1809,BRANCH_STREET#1810,BRANCH_CITY#1811,BRANCH_STATE#1812,BRANCH_ZIP#1813,BRANCH_PHONE#1814,LAST_UPDATED#1815])
               +- Relation [BRANCH_CODE#1808,BRANCH_NAME#1809,BRANCH_STREET#1810,BRANCH_CITY#1811,BRANCH_STATE#1812,BRANCH_ZIP#1813,BRANCH_PHONE#1814,LAST_UPDATED#1815] JDBCRelation(creditcard_capstone.CDW_SAPP_BRANCH) [numPartitions=1]

In [ ]:
# Used to display the number and total values of transactions for branches in a given state.
def tran_no_total_bystate(br_state):
    tr_state=spark.sql("SELECT cc.BRANCH_CODE, COUNT(cc.TRANSACTION_ID) AS NUM_OF_TRANSACTION \
                        SUM(cc.TRANSACTION_VALUE) AS TRANSACTION_TOTAL \
                        FROM customer c\
                        JOIN credit_card cc ON cc.BRANCH_CODE=br.BRANCH_CODE \
                        WHERE br.BRANCH_STATE = '{}' \
                        GROUP BY br.BRANCH_NAME".format(br_state))
    return tr_state

In [ ]:
def tran2_input():
    transaction_type=spark.sql("SELECT DISTINCT(TRANSACTION_TYPE) FOR CREDIT").toPandas().tolist()

In [396]:
tran_count_sum_bytype("Gas")

+----------------+------------------+------------------+
|TRANSACTION_TYPE|NUM_OF_TRANSACTION| TOTAL_TRAN_VALUES|
+----------------+------------------+------------------+
|             Gas|              6605|336059.25999999954|
+----------------+------------------+------------------+

In [285]:
spark.sql("select day(to_date(TIMEID,'yyyyMMdd')) from credit_card").show()

+------------------------------+
|day(to_date(TIMEID, yyyyMMdd))|
+------------------------------+
|                            10|
|                            27|
|                             7|
|                            21|
|                            20|
|                             4|
|                            28|
|                             8|
|                            21|
|                            24|
|                            27|
|                             8|
|                            22|
|                            17|
|                             8|
|                            11|
|                            25|
|                            10|
|                            19|
|                             2|
+------------------------------+
only showing top 20 rows

In [199]:
#function to get the transactions made by customers living in a given zip code for a given month and year. 
# Order by day in descending order.
# @Dprint
# def transaction_by_zipcode(zipcode,year,month):
#     return spark.sql("SELECT * FROM credit_card cc\
#                   JOIN customer c ON  c.SSN=cc.CUST_SSN\
#                   WHERE c.CUST_ZIP = '{}' AND TIMEID LIKE CONCAT({},lpad({},2,'0'),'%')\
#                   ORDER BY TIMEID DESC".format(zipcode,year,month))

In [156]:
#  #function to get the number and total values of transactions for a given type.
# def tran_count_sum_bytype(tr_type):
#     tr_result=spark.sql("SELECT COUNT(TRANSACTION_ID) AS NUM_OF_TRANSACTION, \
#                         SUM(TRANSACTION_VALUE) AS TOTAL_TRAN_VALUES FROM credit_card\
#                         WHERE TRANSACTION_TYPE='{}'\
#                         GROUP BY TRANSACTION_TYPE".format(tr_type))
#     return tr_result

In [157]:
# tr_count_sum_df=tran_count_sum_bytype("Gas")

In [303]:
# Used to display the number and total values of transactions for branches in a given state.
def tran_count_sum_bystate(br_state):
    tr_state=spark.sql("SELECT COUNT(TRANSACTION_ID) AS NUM_OF_TRANSACTION \
                        SUM(TRANSACTION_VALUE) AS TRANSACTION_TOTAL \
                        FROM credit_card \
                        JOIN branch ON credit_card.BRANCH_CODE=branch.BRANCH_CODE \
                        WHERE branch.BRANCH_STATE = '{}' \
                        GROUP BY branch.BRANCH_NAME".format(br_state))
    return tr_state

In [304]:
tr_bystate=tran_count_sum_bystate("MN")
tr_bystate.show()

+------------------+-----------------+
|NUM_OF_TRANSACTION|TRANSACTION_TOTAL|
+------------------+-----------------+
|              1127|         56153.29|
+------------------+-----------------+

In [228]:
#function to check the existing account details of a customer by ssn or full name, phone number and registermail.
def cust_details(ssn,name=" ",middlename="",lastname="",email="",phone=""):
    return spark.sql("SELECT * FROM CUSTOMER \
               WHERE SSN = '{}' OR FIRST_NAME='{}' AND MIDDLE_NAME='{}' AND LAST_NAME='{}' \
                     AND CUST_EMAIL ='{}' AND CUST_PHONE = '{}' "\
                    .format(ssn,name,middlename,lastname,email,phone))

In [229]:
cust_details=cust_details("12","Alec","tracie","Gilmore","AGilmore@example.com","(214)124-0689")

In [230]:
cust_details.show()

+---------+----------+-----------+---------+----------------+-------------------+---------+----------+-------------+--------+-------------+--------------------+-------------------+
|      SSN|FIRST_NAME|MIDDLE_NAME|LAST_NAME|  CREDIT_CARD_NO|FULL_STREET_ADDRESS|CUST_CITY|CUST_STATE| CUST_COUNTRY|CUST_ZIP|   CUST_PHONE|          CUST_EMAIL|       LAST_UPDATED|
+---------+----------+-----------+---------+----------------+-------------------+---------+----------+-------------+--------+-------------+--------------------+-------------------+
|123457511|      Alec|     tracie|  Gilmore|4210653310773972|   Forest Street,81|   Owosso|        MI|United States|   48867|(214)124-0689|AGilmore@example.com|2018-04-21 12:49:02|
+---------+----------+-----------+---------+----------------+-------------------+---------+----------+-------------+--------+-------------+--------------------+-------------------+

In [291]:
#function used to generate a monthly bill for a credit card number for a given month and year.
cc_number=4210653342697335
yr=2018
month=8
spark.sql("SELECT SUM(TRANSACTION_VALUE) AS MONTHLY_BILL FROM credit_card cc\
           JOIN customer c ON cc.CUST_CC_NO=c.CREDIT_CARD_NO \
           WHERE cc.CUST_CC_NO = '{}' AND MONTH(to_date(TIMEID,'yyyyMMdd')) = '{}' \
           AND YEAR(to_date(TIMEID,'yyyyMMdd'))='{}'\
           GROUP BY cc.CUST_CC_NO".format(cc_number,month,yr)).show()

+------------+
|MONTHLY_BILL|
+------------+
|      692.45|
+------------+

In [306]:
spark.sql("SELECT SUM(TRANSACTION_VALUE) AS MONTHLY_BILL,cc.TRANSACTION_TYPE FROM credit_card cc\
           JOIN customer c ON cc.CUST_CC_NO=c.CREDIT_CARD_NO \
           WHERE cc.CUST_CC_NO = '{}' AND MONTH(to_date(TIMEID,'yyyyMMdd')) = '{}' \
           AND YEAR(to_date(TIMEID,'yyyyMMdd'))='{}'\
           GROUP BY cc.TRANSACTION_TYPE".format(cc_number,month,yr)).show()

+------------+----------------+
|MONTHLY_BILL|TRANSACTION_TYPE|
+------------+----------------+
|        3.82|       Education|
|       74.83|         Grocery|
|      166.22|            Test|
|      350.72|             Gas|
|       96.86|           Bills|
+------------+----------------+

In [332]:
# function to display the transactions made by a customer between two dates. Order by year, month, and day in descending order.
@Dprint
def transaction_bet(ssn,date1,date2):
    return spark.sql("SELECT * FROM credit_card \
                      JOIN customer ON customer.SSN=credit_card.CUST_SSN\
                      WHERE customer.SSN='{}' AND to_date(TIMEID,'yyyyMMdd') >= to_date('{}','yyyyMMdd') AND \
                      to_date(TIMEID,'yyyyMMdd') <= TO_date('{}','yyyyMMdd') \
                      ORDER BY YEAR(to_date(TIMEID,'yyyyMMdd')) DESC, MONTH(to_date(TIMEID,'yyyyMMdd')) DESC, \
                      DAY(to_date(TIMEID,'yyyyMMdd')) DESC"\
                     .format(ssn,date1,date2))

In [333]:
transaction_bet(123454487,20180123,20180325)

+----------------+--------+---------+-----------+----------------+-----------------+--------------+---------+----------+-----------+---------+----------------+--------------------+---------+----------+-------------+--------+-------------+-------------------+-------------------+
|      CUST_CC_NO|  TIMEID| CUST_SSN|BRANCH_CODE|TRANSACTION_TYPE|TRANSACTION_VALUE|TRANSACTION_ID|      SSN|FIRST_NAME|MIDDLE_NAME|LAST_NAME|  CREDIT_CARD_NO| FULL_STREET_ADDRESS|CUST_CITY|CUST_STATE| CUST_COUNTRY|CUST_ZIP|   CUST_PHONE|         CUST_EMAIL|       LAST_UPDATED|
+----------------+--------+---------+-----------+----------------+-----------------+--------------+---------+----------+-----------+---------+----------------+--------------------+---------+----------+-------------+--------+-------------+-------------------+-------------------+
|4210653310116272|20180321|123454487|        105|             Gas|            88.42|         28702|123454487|    Wilber|   ezequiel|   Dunham|4210653310116272|12th Street East,683|  Huntley|        IL|United States|   60142|(211)124-3018|WDunham@example.com|2018-04-21 12:49:02|
|4210653310116272|20180320|123454487|         19|            Test|            50.15|         28699|123454487|    Wilber|   ezequiel|   Dunham|4210653310116272|12th Street East,683|  Huntley|        IL|United States|   60142|(211)124-3018|WDunham@example.com|2018-04-21 12:49:02|
|4210653310116272|20180224|123454487|        192|            Test|            70.37|         28709|123454487|    Wilber|   ezequiel|   Dunham|4210653310116272|12th Street East,683|  Huntley|        IL|United States|   60142|(211)124-3018|WDunham@example.com|2018-04-21 12:49:02|
|4210653310116272|20180220|123454487|         48|            Test|            62.97|         28704|123454487|    Wilber|   ezequiel|   Dunham|4210653310116272|12th Street East,683|  Huntley|        IL|United States|   60142|(211)124-3018|WDunham@example.com|2018-04-21 12:49:02|
|4210653310116272|20180218|123454487|        118|            Test|            58.83|         28728|123454487|    Wilber|   ezequiel|   Dunham|4210653310116272|12th Street East,683|  Huntley|        IL|United States|   60142|(211)124-3018|WDunham@example.com|2018-04-21 12:49:02|
+----------------+--------+---------+-----------+----------------+-----------------+--------------+---------+----------+-----------+---------+----------------+--------------------+---------+----------+-------------+--------+-------------+-------------------+-------------------+

In [275]:
cc_number=4210653342697335
yr=2018
month=8
spark.sql("SELECT SUM(TRANSACTION_VALUE) AS MONTHLY_BILL FROM credit_card\
           JOIN customer ON credit_card.CUST_CC_NO=customer.CREDIT_CARD_NO \
           WHERE credit_card.CUST_CC_NO = '{}' AND TIMEID LIKE CONCAT({},LPAD({},2,'0'),'%')\
           GROUP BY credit_card.CUST_CC_NO".format(cc_number,yr,month)).show()

+------------+
|MONTHLY_BILL|
+------------+
|      692.45|
+------------+

In [277]:
#function used to generate a monthly bill for a credit card number for a given month and year.
cc_number=4210653342697335
yr=2018
month=8
spark.sql("SELECT SUM(TRANSACTION_VALUE) AS MONTHLY_BILL FROM credit_card cc\
           JOIN customer c ON cc.CUST_CC_NO=c.CREDIT_CARD_NO \
           WHERE cc.CUST_CC_NO = '{}' AND MONTH(to_date(TIMEID,'yyyyMMdd')) = '{}' \
           AND YEAR(to_date(TIMEID,'yyyyMMdd'))='{}'\
           GROUP BY cc.CUST_CC_NO".format(cc_number,month,yr)).show()

+------------+
|MONTHLY_BILL|
+------------+
|      692.45|
+------------+

In [ ]:
cc_number=4210653342697335
yr=2018
month=8
spark.sql("SELECT SUM(TRANSACTION_VALUE) AS MONTHLY_BILL\
          FROM credit_card \
          JOIN customer on credit_card.CUST_CC_NO=customer.CREDIT_CARD_NO \
          WHERE CUST_CC_NO = '{}' AND MONTH(to_date(TIMEID,'yyyyMMdd')) = '{}' \
          AND YEAR(to_date(TIMEID,'yyyyMMdd'))='{}'\
          GROUP BY credit_card.CREDIT_CARD_NO".format(cc_number,month,yr)).show()

In [264]:
cc_number=4210653342697335
yr=2018
month=8
spark.sql("SELECT TRANSACTION_VALUE,TRANSACTION_TYPE,TIMEID FROM credit_card \
                      WHERE CUST_CC_NO = '{}' AND MONTH(to_date(TIMEID,'yyyyMMdd')) = '{}' \
           AND YEAR(to_date(TIMEID,'yyyyMMdd'))='{}'\
         ".format(cc_number,month,yr)).show()

+-----------------+----------------+--------+
|TRANSACTION_VALUE|TRANSACTION_TYPE|  TIMEID|
+-----------------+----------------+--------+
|            82.98|             Gas|20180811|
|            67.39|            Test|20180812|
|             3.82|       Education|20180801|
|            28.42|             Gas|20180803|
|            49.67|           Bills|20180825|
|            40.06|             Gas|20180824|
|            98.28|             Gas|20180825|
|            98.83|            Test|20180804|
|            74.83|         Grocery|20180809|
|           100.98|             Gas|20180807|
|            47.19|           Bills|20180814|
+-----------------+----------------+--------+

In [ ]:
#function used to generate a monthly bill for a credit card number for a given month and year.
def generate_monthly_bill(cc_number,year,month):
    return spark.sql("SELECT SUM(TRANSACTION_VALUE) FROM credit_card \
                      WHERE CUST_CC_NO = '{}' AND MONTH(to_date(TIMEID,'yyyyMMdd')) = '{}' AND YEAR(to_date(TIMEID,'yyyyMMdd'))='{}'")

In [322]:
# function to display the transactions made by a customer between two dates. Order by year, month, and day in descending order.
date1=20180123
date2=20180325
ssn=123454487
# def transaction_bet(ssn,date1,date2):
spark.sql("SELECT * FROM credit_card \
          JOIN customer ON customer.SSN=credit_card.CUST_SSN\
          WHERE customer.SSN='{}' AND to_date(TIMEID,'yyyyMMdd') >= to_date('{}','yyyyMMdd') AND \
          to_date(TIMEID,'yyyyMMdd') <= TO_date('{}','yyyyMMdd') \
          ORDER BY YEAR(to_date(TIMEID,'yyyyMMdd')) DESC, MONTH(to_date(TIMEID,'yyyyMMdd')) DESC, DAY(to_date(TIMEID,'yyyyMMdd')) DESC"\
          .format(ssn,date1,date2)).show()

+----------------+--------+---------+-----------+----------------+-----------------+--------------+---------+----------+-----------+---------+----------------+--------------------+---------+----------+-------------+--------+-------------+-------------------+-------------------+
|      CUST_CC_NO|  TIMEID| CUST_SSN|BRANCH_CODE|TRANSACTION_TYPE|TRANSACTION_VALUE|TRANSACTION_ID|      SSN|FIRST_NAME|MIDDLE_NAME|LAST_NAME|  CREDIT_CARD_NO| FULL_STREET_ADDRESS|CUST_CITY|CUST_STATE| CUST_COUNTRY|CUST_ZIP|   CUST_PHONE|         CUST_EMAIL|       LAST_UPDATED|
+----------------+--------+---------+-----------+----------------+-----------------+--------------+---------+----------+-----------+---------+----------------+--------------------+---------+----------+-------------+--------+-------------+-------------------+-------------------+
|4210653310116272|20180321|123454487|        105|             Gas|            88.42|         28702|123454487|    Wilber|   ezequiel|   Dunham|4210653310116272|12th Street East,683|  Huntley|        IL|United States|   60142|(211)124-3018|WDunham@example.com|2018-04-21 12:49:02|
|4210653310116272|20180320|123454487|         19|            Test|            50.15|         28699|123454487|    Wilber|   ezequiel|   Dunham|4210653310116272|12th Street East,683|  Huntley|        IL|United States|   60142|(211)124-3018|WDunham@example.com|2018-04-21 12:49:02|
|4210653310116272|20180224|123454487|        192|            Test|            70.37|         28709|123454487|    Wilber|   ezequiel|   Dunham|4210653310116272|12th Street East,683|  Huntley|        IL|United States|   60142|(211)124-3018|WDunham@example.com|2018-04-21 12:49:02|
|4210653310116272|20180220|123454487|         48|            Test|            62.97|         28704|123454487|    Wilber|   ezequiel|   Dunham|4210653310116272|12th Street East,683|  Huntley|        IL|United States|   60142|(211)124-3018|WDunham@example.com|2018-04-21 12:49:02|
|4210653310116272|20180218|123454487|        118|            Test|            58.83|         28728|123454487|    Wilber|   ezequiel|   Dunham|4210653310116272|12th Street East,683|  Huntley|        IL|United States|   60142|(211)124-3018|WDunham@example.com|2018-04-21 12:49:02|
+----------------+--------+---------+-----------+----------------+-----------------+--------------+---------+----------+-----------+---------+----------------+--------------------+---------+----------+-------------+--------+-------------+-------------------+-------------------+

In [318]:
spark.sql("select to_date(20180823,'yyyyMMdd') ").show()

+---------------------------+
|to_date(20180823, yyyyMMdd)|
+---------------------------+
|                 2018-08-23|
+---------------------------+

In [ ]:
def main_menu():
    print("--Main Menu--")
    print("Please select from the following options:")
    print('1 - View Trannsaction')
    print('2 - View/Edit Customer data')
    print('0 - exit')
    choice=input("Choice : ")
    return choice

def console_input(menu_choice):
    while menu_choice!='0':
        match menu_choice:
            case "1":
                t_choice=transaction_menu()
                transaction_requiremnt(t_choice)
                menu_choice=main_menu()

            case "2":
                cust_choice=customer_menu()
                custmer_requirement(cust_choice)
                menu_choice=main_menu()

            case "0":
                return 0
            
            case _:
                print("Invalid choice, please select valid option from the menu")
                menu_choice=main_menu()

def transaction_menu():
    print("\n")
    print("--Transaction Menu--")
    print("please select option to display total transaction from the follwing menu :")
    print("1 :  Transactions made by customers living in a given zip code for a given month and year")
    print("2 :  Number and Total values of transactions for a given type.")
    print("3 :  Number and Total values of transactions for branches in a given state")
    print("0 :  Return to Main Menu")
    choice=input("Choice : ")
    return choice

def transaction_requirement(t_choice):
    while t_choice!='0':
        match t_choice:
            case '1':
                tran_option1_input():

In [350]:
def tran_option1_input():
    flag=0
    while(flag == 0):
        print("Please enter 4-5 digit zipcode for ex :(60142)")
        zipcode = input("Enter a zipcode: ")
        print("Enter month in the format MM :")
        print("For example, January would be input as 01, February as 02,etc")
        month= input("Enter a month: ")
        print("Enter year in the format YYYY :")
        year=input("Enter Year :")
        if (zipcode.isdigit() and len(zipcode)> 3) and (month.isdigit() and len(month) < 3) and (year.isdigit() and len(year)==4):
            flag=1
            return(zipcode,month,year)
            break

zipcode,month,year=tran_option1_input()

Please enter 4-5 digit zipcode for ex :(60142)
Enter month in the format MM :
For example, January would be input as 01, February as 02,etc
Enter year in the format YYYY :
Please enter 4-5 digit zipcode for ex :(60142)
Enter month in the format MM :
For example, January would be input as 01, February as 02,etc
Enter year in the format YYYY :
Please enter 4-5 digit zipcode for ex :(60142)
Enter month in the format MM :
For example, January would be input as 01, February as 02,etc
Enter year in the format YYYY :

In [351]:
print(zipcode,month,year)

19034 12 1973